In [8]:
import pandas as pd
import seaborn as sns

print(pd.__version__)
print(sns.__version__)

2.1.4
0.12.2

In [10]:
iris = sns.load_dataset("iris")
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [12]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [14]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [16]:
iris['species'].value_counts() #열의 각 값에 대한 모든 발생 횟수를 반환

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [18]:
type(iris['species'].value_counts())

pandas.core.series.Series

 - Series 데이터 타입
 - https://pandas.pydata.org/docs/reference/api/pandas.Series.html

In [21]:
iris['species'].value_counts().index

Index(['setosa', 'versicolor', 'virginica'], dtype='object', name='species')

In [23]:
iris['species'].value_counts().array

<NumpyExtensionArray>
[50, 50, 50]
Length: 3, dtype: int64

In [25]:
iris['species'].value_counts().values

array([50, 50, 50], dtype=int64)

In [27]:
iris['species'].value_counts().memory_usage

<bound method Series.memory_usage of species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64>

In [29]:
df = iris.drop("species", axis =1) # 해당하는 컬럼값만 제외하고 출력
df.head(1)

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2

In [31]:
iris.shape,df.shape  #위에서 컬럼하나를 빼고해서 shape가 4가 됨

((150, 5), (150, 4))

In [33]:
df2 = iris.drop(['sepal_length','sepal_width'], axis=1)
df2.head(1)

   petal_length  petal_width species
0           1.4          0.2  setosa

In [35]:
iris.shape, df.shape, df2.shape

((150, 5), (150, 4), (150, 3))

In [37]:
df3 = iris.drop([0,1,2], axis=0)
df3.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
3           4.6          3.1           1.5          0.2  setosa

In [39]:
df3 = iris.drop([0,1,2], axis=0).reset_index(drop=True)  #인덱스가 0으로 시작하게 해주는것
df3.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           4.6          3.1           1.5          0.2  setosa

In [41]:
iris.shape, df.shape, df2.shape, df3.shape

((150, 5), (150, 4), (150, 3), (147, 5))

# 파일 입출력
- 파일 내보내기
-

In [44]:
iris.to_csv("iris.csv")  #빈 이름의 컬럼이 생겨서 인덱스를 만든다.

In [46]:
iris.to_csv("iris2.csv", index=False)

In [48]:
iris.to_csv("./test_data/iris.csv", index=False)

# 파일 불러오기

In [51]:
iris_df = pd.read_csv("./test_data/iris.csv")
iris_df.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [53]:
DATA_PATH = './kaggle/playground-series-s4e7/train.csv'
train = pd.read_csv(DATA_PATH)
train.head(1)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,0,Male,21,1,35.0,0,1-2 Year,Yes,65101.0,124.0,187,0

In [55]:
DATA_PATH = './kaggle/playground-series-s4e7/'
train = pd.read_csv(DATA_PATH + 'train.csv')
train.head(1)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,0,Male,21,1,35.0,0,1-2 Year,Yes,65101.0,124.0,187,0

## iloc vs loc 차이
- 강사님 왈 : 일단은 loc만 기억( 이유 => 직관적임)

In [58]:
#iris.loc(행,열)
iris.loc[:, ['sepal_length', 'species']].head(3)

   sepal_length species
0           5.1  setosa
1           4.9  setosa
2           4.7  setosa

In [60]:
cols = ['sepal_length','species']
iris.loc[:,cols].head(3)

   sepal_length species
0           5.1  setosa
1           4.9  setosa
2           4.7  setosa

In [62]:
#cols = ['sepal_length','species']
#iris.loc[iris['sepal_length'] >= 7.5, cols]

cols = ['sepal_width','species']
iris.loc[iris['sepal_width']>= 3.9,cols]

cols = ['petal_length','species']
iris.loc[iris['petal_length'] >= 6.3, cols]

     petal_length    species
105           6.6  virginica
107           6.3  virginica
117           6.7  virginica
118           6.9  virginica
122           6.7  virginica
131           6.4  virginica

## 문제1.
- petal_length가 1.7이상인 값을 조회하고, 필드명은 sepal_width, petal_length만 추출

In [65]:
cols = ['sepal_width', 'petal_length']
result = iris.loc[iris['petal_length']>=1.7, cols].reset_index(drop = True)
result

     sepal_width  petal_length
0            3.9           1.7
1            3.8           1.7
2            3.4           1.7
3            3.3           1.7
4            3.4           1.9
..           ...           ...
101          3.0           5.2
102          2.5           5.0
103          3.0           5.2
104          3.4           5.4
105          3.0           5.1

[106 rows x 2 columns]

## 다중조건
- AND 연산자 : 교집합, &
- OR 연산자 : 합집합,

In [ ]:
cols = ['sepal_width', 'petal_length']
result = iris.loc[(조건1) & (조건2), cols].reset_index(drop = True) #조건을 여러가지
result

In [72]:
result1 = iris.loc[(iris['species'] == 'setosa')]
result2 = result1.loc[iris['sepal_length'] <= 5.1]
result2.shape

(36, 5)

In [74]:
cols = ['sepal_width', 'petal_length']
result = iris.loc[(iris['species'] == 'setosa') &\
                  (iris['sepal_length'] <= 5.1), cols].reset_index(drop = True)
result.shape

(36, 2)

In [76]:
train.head()

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,0,Male,21,1,35.0,0,1-2 Year,Yes,65101.0,124.0,187,0
1,1,Male,43,1,28.0,0,> 2 Years,Yes,58911.0,26.0,288,1
2,2,Female,25,1,14.0,1,< 1 Year,No,38043.0,152.0,254,0
3,3,Female,35,1,1.0,0,1-2 Year,Yes,2630.0,156.0,76,0
4,4,Female,36,1,15.0,1,1-2 Year,No,31951.0,152.0,294,0

## 테스트1.
- Gender가 Male인것만 조회하고, 전체 행의개수는?

In [79]:
# train.loc[행, 열]
train.loc[:, :].head(1)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,0,Male,21,1,35.0,0,1-2 Year,Yes,65101.0,124.0,187,0

In [81]:
train.loc[(train['Gender'] == 'Male')].shape
#type(train.loc[(train['Gender'] == 'Male')].shape) --> tuple

(6228134, 12)

In [83]:
train.loc[(train['Gender'] == 'Male')].shape[0]

6228134

## 문제 2.

In [85]:
train['Vehicle_Age'].value_counts()
# Vehicle_Age가 1-2 Year과 < 1 Year만 추출
# isin() 연산자 활용

Vehicle_Age
1-2 Year     5982678
< 1 Year     5044145
> 2 Years     477975
Name: count, dtype: int64

In [87]:
s = pd.Series(['llama', 'cow', 'llama', 'beetle', 'llama', 
                'hippo'], name = 'animal')
s.isin(['cow', 'llama'])

0     True
1     True
2     True
3    False
4     True
5    False
Name: animal, dtype: bool

In [89]:
Vehicle_Age_Values = ['1-2 Year', '< 1 Year']
train.loc[train['Vehicle_Age'].isin(Vehicle_Age_Values), :].shape

(11026823, 12)

In [91]:
train['Vehicle_Age'][2]

'< 1 Year'

In [93]:
from pandas import Series
import pandas as pd

data = {'Suwon': 10000, 'Daejeon':20000, 'Yangyang': 35000, 'Busan': 50000}
obj = Series(data)
obj

Suwon       10000
Daejeon     20000
Yangyang    35000
Busan       50000
dtype: int64

In [4]:
import pandas as pd

df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9